#include <stdio.h>

int main() {
    int y1, m1, d1;
    int y2, m2, d2;

    printf("Введіть дату народження першої людини (рік місяць день): ");
    scanf ("%d %d %d", &y1, &m1, &d1);

    printf("Введіть дату народження другої людини (рік місяць день):");
    scanf("%d %d %d", &y2, &m2, &d2);

    // обислюємо вік кожної людини
    int age1 = (2023 - y1) * 12 + (4 -m1);
    int age2 = (2023 - y2) * 12 + (4 - m2);

    //порівнюємо вік кожної людини
    if (age1 > age2) {
        printf("Перша людина старша на %d місяців\n", age1 - age2);
    } else if (age2 > age1) {
        printf("Друга людина старша на %d місяців\n", age2 - age1);
    } else {
        printf("Обидві людини народилися у одному місяці та році\n");
    }
    
    return 0;
   }